Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/include/proc/p32mm0128gpm048.h
extern volatile __I2C1MSKbits_t I2C1MSKbits __asm__ ("I2C1MSK") __attribute__((section("sfrs"), address(0xBF801530)));
extern volatile uint32_t        I2C1MSKCLR __attribute__((section("sfrs"),address(0xBF801534)));
extern volatile uint32_t        I2C1MSKSET __attribute__((section("sfrs"),address(0xBF801538)));
extern volatile uint32_t        I2C1MSKINV __attribute__((section("sfrs"),address(0xBF80153C)));
#define I2C1BRG I2C1BRG
extern volatile uint32_t   I2C1BRG __attribute__((section("sfrs"), address(0xBF801540)));
typedef struct {
  uint32_t I2CBRG:16;
} __I2C1BRGbits_t;
extern volatile __I2C1BRGbits_t I2C1BRGbits __asm__ ("I2C1BRG") __attribute__((section("sfrs"), address(0xBF801540)));
extern volatile uint32_t        I2C1BRGCLR __attribute__((section("sfrs"),address(0xBF801544)));
extern volatile uint32_t        I2C1BRGSET __attribute__((section("sfrs"),address(0xBF801548)));
extern volatile uint32_t        I2C1BRGINV __attribute__((section("sfrs"),address(0xBF80154C)));
#define I2C1TRN I2C1TRN
extern volatile uint32_t   I2C1TRN __attribute__((section("sfrs"), address(0xBF801550)));
typedef struct {
  uint32_t I2CTRN:8;
} __I2C1TRNbits_t;
extern volatile __I2C1TRNbits_t I2C1TRNbits __asm__ ("I2C1TRN") __attribute__((section("sfrs"), address(0xBF801550)));
extern volatile uint32_t        I2C1TRNCLR __attribute__((section("sfrs"),address(0xBF801554)));
extern volatile uint32_t        I2C1TRNSET __attribute__((section("sfrs"),address(0xBF801558)));
extern volatile uint32_t        I2C1TRNINV __attribute__((section("sfrs"),address(0xBF80155C)));
#define I2C1RCV I2C1RCV
extern volatile uint32_t   I2C1RCV __attribute__((section("sfrs"), address(0xBF801560)));
typedef struct {
  uint32_t I2CRCV:8;
} __I2C1RCVbits_t;
extern volatile __I2C1RCVbits_t I2C1RCVbits __asm__ ("I2C1RCV") __attribute__((section("sfrs"), address(0xBF801560)));
extern volatile uint32_t        I2C1RCVCLR __attribute__((section("sfrs"),address(0xBF801564)));
extern volatile uint32_t        I2C1RCVSET __attribute__((section("sfrs"),address(0xBF801568)));
extern volatile uint32_t        I2C1RCVINV __attribute__((section("sfrs"),address(0xBF80156C)));
#define I2C2CON I2C2CON
extern volatile uint32_t   I2C2CON __attribute__((section("sfrs"), address(0xBF801600)));
typedef union {
  struct {
    uint32_t SEN:1;
    uint32_t RSEN:1;
    uint32_t PEN:1;
    uint32_t RCEN:1;
    uint32_t ACKEN:1;
    uint32_t ACKDT:1;
    uint32_t STREN:1;
    uint32_t GCEN:1;
    uint32_t SMEN:1;
    uint32_t DISSLW:1;
    uint32_t A10M:1;
    uint32_t STRICT:1;
    uint32_t SCLREL:1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t :2;
    uint32_t SBCDE:1;
    uint32_t SDAHT:1;
    uint32_t BOEN:1;
    uint32_t SCIE:1;
    uint32_t PCIE:1;
  };
  struct {
    uint32_t :11;
    uint32_t IPMIEN:1;
    uint32_t :1;
    uint32_t I2CSIDL:1;
    uint32_t :1;
    uint32_t I2CEN:1;
  };
} __I2C2CONbits_t;
extern volatile __I2C2CONbits_t I2C2CONbits __asm__ ("I2C2CON") __attribute__((section("sfrs"), address(0xBF801600)));
extern volatile uint32_t        I2C2CONCLR __attribute__((section("sfrs"),address(0xBF801604)));
extern volatile uint32_t        I2C2CONSET __attribute__((section("sfrs"),address(0xBF801608)));
extern volatile uint32_t        I2C2CONINV __attribute__((section("sfrs"),address(0xBF80160C)));
#define I2C2STAT I2C2STAT
extern volatile uint32_t   I2C2STAT __attribute__((section("sfrs"), address(0xBF801610)));
typedef union {
  struct {
    uint32_t TBF:1;
    uint32_t RBF:1;
    uint32_t R_W:1;
    uint32_t S:1;
    uint32_t P:1;
    uint32_t D_A:1;
    uint32_t I2COV:1;
    uint32_t IWCOL:1;
    uint32_t ADD10:1;
    uint32_t GCSTAT:1;
    uint32_t BCL:1;
    uint32_t :2;
    uint32_t ACKTIM:1;
    uint32_t TRSTAT:1;
    uint32_t ACKSTAT:1;
  };
  struct {
    uint32_t :6;
    uint32_t I2CPOV:1;
  };
} __I2C2STATbits_t;
extern volatile __I2C2STATbits_t I2C2STATbits __asm__ ("I2C2STAT") __attribute__((section("sfrs"), address(0xBF801610)));
extern volatile uint32_t        I2C2STATCLR __attribute__((section("sfrs"),address(0xBF801614)));
extern volatile uint32_t        I2C2STATSET __attribute__((section("sfrs"),address(0xBF801618)));
extern volatile uint32_t        I2C2STATINV __attribute__((section("sfrs"),address(0xBF80161C)));
#define I2C2ADD I2C2ADD
extern volatile uint32_t   I2C2ADD __attribute__((section("sfrs"), address(0xBF801620)));
typedef struct {
  uint32_t I2CADD:10;
} __I2C2ADDbits_t;
extern volatile __I2C2ADDbits_t I2C2ADDbits __asm__ ("I2C2ADD") __attribute__((section("sfrs"), address(0xBF801620)));
extern volatile uint32_t        I2C2ADDCLR __attribute__((section("sfrs"),address(0xBF801624)));
extern volatile uint32_t        I2C2ADDSET __attribute__((section("sfrs"),address(0xBF801628)));
extern volatile uint32_t        I2C2ADDINV __attribute__((section("sfrs"),address(0xBF80162C)));
#define I2C2MSK I2C2MSK
extern volatile uint32_t   I2C2MSK __attribute__((section("sfrs"), address(0xBF801630)));
typedef union {
  struct {
    uint32_t I2CMSK:10;
  };
  struct {
    uint32_t AMSK:10;
  };
} __I2C2MSKbits_t;
extern volatile __I2C2MSKbits_t I2C2MSKbits __asm__ ("I2C2MSK") __attribute__((section("sfrs"), address(0xBF801630)));
extern volatile uint32_t        I2C2MSKCLR __attribute__((section("sfrs"),address(0xBF801634)));
extern volatile uint32_t        I2C2MSKSET __attribute__((section("sfrs"),address(0xBF801638)));
extern volatile uint32_t        I2C2MSKINV __attribute__((section("sfrs"),address(0xBF80163C)));
#define I2C2BRG I2C2BRG
extern volatile uint32_t   I2C2BRG __attribute__((section("sfrs"), address(0xBF801640)));
typedef struct {
  uint32_t I2CBRG:16;
} __I2C2BRGbits_t;
extern volatile __I2C2BRGbits_t I2C2BRGbits __asm__ ("I2C2BRG") __attribute__((section("sfrs"), address(0xBF801640)));
extern volatile uint32_t        I2C2BRGCLR __attribute__((section("sfrs"),address(0xBF801644)));
extern volatile uint32_t        I2C2BRGSET __attribute__((section("sfrs"),address(0xBF801648)));
extern volatile uint32_t        I2C2BRGINV __attribute__((section("sfrs"),address(0xBF80164C)));
#define I2C2TRN I2C2TRN
extern volatile uint32_t   I2C2TRN __attribute__((section("sfrs"), address(0xBF801650)));
typedef struct {
  uint32_t I2CTRN:8;
} __I2C2TRNbits_t;
extern volatile __I2C2TRNbits_t I2C2TRNbits __asm__ ("I2C2TRN") __attribute__((section("sfrs"), address(0xBF801650)));
extern volatile uint32_t        I2C2TRNCLR __attribute__((section("sfrs"),address(0xBF801654)));
extern volatile uint32_t        I2C2TRNSET __attribute__((section("sfrs"),address(0xBF801658)));
extern volatile uint32_t        I2C2TRNINV __attribute__((section("sfrs"),address(0xBF80165C)));
#define I2C2RCV I2C2RCV
extern volatile uint32_t   I2C2RCV __attribute__((section("sfrs"), address(0xBF801660)));
typedef struct {
  uint32_t I2CRCV:8;
} __I2C2RCVbits_t;
