Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/include/proc/p32mm0128gpm048.h
extern volatile __CNPUCbits_t CNPUCbits __asm__ ("CNPUC") __attribute__((section("sfrs"), address(0xBF802E00)));
extern volatile uint32_t        CNPUCCLR __attribute__((section("sfrs"),address(0xBF802E04)));
extern volatile uint32_t        CNPUCSET __attribute__((section("sfrs"),address(0xBF802E08)));
extern volatile uint32_t        CNPUCINV __attribute__((section("sfrs"),address(0xBF802E0C)));
#define CNPDC CNPDC
extern volatile uint32_t   CNPDC __attribute__((section("sfrs"), address(0xBF802E10)));
typedef union {
  struct {
    uint32_t CNPDC0:1;
    uint32_t CNPDC1:1;
    uint32_t CNPDC2:1;
    uint32_t CNPDC3:1;
    uint32_t CNPDC4:1;
    uint32_t CNPDC5:1;
    uint32_t CNPDC6:1;
    uint32_t CNPDC7:1;
    uint32_t CNPDC8:1;
    uint32_t CNPDC9:1;
    uint32_t :2;
    uint32_t CNPDC12:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPDCbits_t;
extern volatile __CNPDCbits_t CNPDCbits __asm__ ("CNPDC") __attribute__((section("sfrs"), address(0xBF802E10)));
extern volatile uint32_t        CNPDCCLR __attribute__((section("sfrs"),address(0xBF802E14)));
extern volatile uint32_t        CNPDCSET __attribute__((section("sfrs"),address(0xBF802E18)));
extern volatile uint32_t        CNPDCINV __attribute__((section("sfrs"),address(0xBF802E1C)));
#define CNCONC CNCONC
extern volatile uint32_t   CNCONC __attribute__((section("sfrs"), address(0xBF802E20)));
typedef union {
  struct {
    uint32_t :10;
    uint32_t PORT32:1;
    uint32_t CNSTYLE:1;
    uint32_t :3;
    uint32_t ON:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNCONCbits_t;
extern volatile __CNCONCbits_t CNCONCbits __asm__ ("CNCONC") __attribute__((section("sfrs"), address(0xBF802E20)));
extern volatile uint32_t        CNCONCCLR __attribute__((section("sfrs"),address(0xBF802E24)));
extern volatile uint32_t        CNCONCSET __attribute__((section("sfrs"),address(0xBF802E28)));
extern volatile uint32_t        CNCONCINV __attribute__((section("sfrs"),address(0xBF802E2C)));
#define CNEN0C CNEN0C
extern volatile uint32_t   CNEN0C __attribute__((section("sfrs"), address(0xBF802E30)));
typedef union {
  struct {
    uint32_t CNIE0C0:1;
    uint32_t CNIE0C1:1;
    uint32_t CNIE0C2:1;
    uint32_t CNIE0C3:1;
    uint32_t CNIE0C4:1;
    uint32_t CNIE0C5:1;
    uint32_t CNIE0C6:1;
    uint32_t CNIE0C7:1;
    uint32_t CNIE0C8:1;
    uint32_t CNIE0C9:1;
    uint32_t :2;
    uint32_t CNIE0C12:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNEN0Cbits_t;
extern volatile __CNEN0Cbits_t CNEN0Cbits __asm__ ("CNEN0C") __attribute__((section("sfrs"), address(0xBF802E30)));
extern volatile uint32_t        CNEN0CCLR __attribute__((section("sfrs"),address(0xBF802E34)));
extern volatile uint32_t        CNEN0CSET __attribute__((section("sfrs"),address(0xBF802E38)));
extern volatile uint32_t        CNEN0CINV __attribute__((section("sfrs"),address(0xBF802E3C)));
#define CNSTATC CNSTATC
extern volatile uint32_t   CNSTATC __attribute__((section("sfrs"), address(0xBF802E40)));
typedef union {
  struct {
    uint32_t CNSTATC0:1;
    uint32_t CNSTATC1:1;
    uint32_t CNSTATC2:1;
    uint32_t CNSTATC3:1;
    uint32_t CNSTATC4:1;
    uint32_t CNSTATC5:1;
    uint32_t CNSTATC6:1;
    uint32_t CNSTATC7:1;
    uint32_t CNSTATC8:1;
    uint32_t CNSTATC9:1;
    uint32_t :2;
    uint32_t CNSTATC12:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNSTATCbits_t;
extern volatile __CNSTATCbits_t CNSTATCbits __asm__ ("CNSTATC") __attribute__((section("sfrs"), address(0xBF802E40)));
extern volatile uint32_t        CNSTATCCLR __attribute__((section("sfrs"),address(0xBF802E44)));
extern volatile uint32_t        CNSTATCSET __attribute__((section("sfrs"),address(0xBF802E48)));
extern volatile uint32_t        CNSTATCINV __attribute__((section("sfrs"),address(0xBF802E4C)));
#define CNEN1C CNEN1C
extern volatile uint32_t   CNEN1C __attribute__((section("sfrs"), address(0xBF802E50)));
typedef union {
  struct {
    uint32_t CNIE1C0:1;
    uint32_t CNIE1C1:1;
    uint32_t CNIE1C2:1;
    uint32_t CNIE1C3:1;
    uint32_t CNIE1C4:1;
    uint32_t CNIE1C5:1;
    uint32_t CNIE1C6:1;
    uint32_t CNIE1C7:1;
    uint32_t CNIE1C8:1;
    uint32_t CNIE1C9:1;
    uint32_t :2;
    uint32_t CNIE1C12:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNEN1Cbits_t;
extern volatile __CNEN1Cbits_t CNEN1Cbits __asm__ ("CNEN1C") __attribute__((section("sfrs"), address(0xBF802E50)));
extern volatile uint32_t        CNEN1CCLR __attribute__((section("sfrs"),address(0xBF802E54)));
extern volatile uint32_t        CNEN1CSET __attribute__((section("sfrs"),address(0xBF802E58)));
extern volatile uint32_t        CNEN1CINV __attribute__((section("sfrs"),address(0xBF802E5C)));
#define CNFC CNFC
extern volatile uint32_t   CNFC __attribute__((section("sfrs"), address(0xBF802E60)));
typedef union {
  struct {
    uint32_t CNFC0:1;
    uint32_t CNFC1:1;
    uint32_t CNFC2:1;
    uint32_t CNFC3:1;
    uint32_t CNFC4:1;
    uint32_t CNFC5:1;
    uint32_t CNFC6:1;
    uint32_t CNFC7:1;
    uint32_t CNFC8:1;
    uint32_t CNFC9:1;
    uint32_t :2;
    uint32_t CNFC12:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNFCbits_t;
extern volatile __CNFCbits_t CNFCbits __asm__ ("CNFC") __attribute__((section("sfrs"), address(0xBF802E60)));
extern volatile uint32_t        CNFCCLR __attribute__((section("sfrs"),address(0xBF802E64)));
extern volatile uint32_t        CNFCSET __attribute__((section("sfrs"),address(0xBF802E68)));
extern volatile uint32_t        CNFCINV __attribute__((section("sfrs"),address(0xBF802E6C)));
#define SR0C SR0C
extern volatile uint32_t   SR0C __attribute__((section("sfrs"), address(0xBF802E70)));
typedef struct {
  uint32_t w:32;
} __SR0Cbits_t;
extern volatile __SR0Cbits_t SR0Cbits __asm__ ("SR0C") __attribute__((section("sfrs"), address(0xBF802E70)));
extern volatile uint32_t        SR0CCLR __attribute__((section("sfrs"),address(0xBF802E74)));
extern volatile uint32_t        SR0CSET __attribute__((section("sfrs"),address(0xBF802E78)));
extern volatile uint32_t        SR0CINV __attribute__((section("sfrs"),address(0xBF802E7C)));
#define SR1C SR1C
extern volatile uint32_t   SR1C __attribute__((section("sfrs"), address(0xBF802E80)));
typedef struct {
  uint32_t w:32;
} __SR1Cbits_t;
extern volatile __SR1Cbits_t SR1Cbits __asm__ ("SR1C") __attribute__((section("sfrs"), address(0xBF802E80)));
extern volatile uint32_t        SR1CCLR __attribute__((section("sfrs"),address(0xBF802E84)));
extern volatile uint32_t        SR1CSET __attribute__((section("sfrs"),address(0xBF802E88)));
extern volatile uint32_t        SR1CINV __attribute__((section("sfrs"),address(0xBF802E8C)));
#define ANSELD ANSELD
extern volatile uint32_t   ANSELD __attribute__((section("sfrs"), address(0xBF802EB0)));
typedef struct {
  uint32_t w:32;
} __ANSELDbits_t;
extern volatile __ANSELDbits_t ANSELDbits __asm__ ("ANSELD") __attribute__((section("sfrs"), address(0xBF802EB0)));
extern volatile uint32_t        ANSELDCLR __attribute__((section("sfrs"),address(0xBF802EB4)));
extern volatile uint32_t        ANSELDSET __attribute__((section("sfrs"),address(0xBF802EB8)));
extern volatile uint32_t        ANSELDINV __attribute__((section("sfrs"),address(0xBF802EBC)));
#define TRISD TRISD
extern volatile uint32_t   TRISD __attribute__((section("sfrs"), address(0xBF802EC0)));
typedef union {
  struct {
    uint32_t TRISD0:1;
  };
  struct {
    uint32_t w:32;
  };
} __TRISDbits_t;
extern volatile __TRISDbits_t TRISDbits __asm__ ("TRISD") __attribute__((section("sfrs"), address(0xBF802EC0)));
extern volatile uint32_t        TRISDCLR __attribute__((section("sfrs"),address(0xBF802EC4)));
extern volatile uint32_t        TRISDSET __attribute__((section("sfrs"),address(0xBF802EC8)));
extern volatile uint32_t        TRISDINV __attribute__((section("sfrs"),address(0xBF802ECC)));
#define PORTD PORTD
extern volatile uint32_t   PORTD __attribute__((section("sfrs"), address(0xBF802ED0)));
typedef union {
  struct {
    uint32_t RD0:1;
  };
  struct {
    uint32_t w:32;
  };
} __PORTDbits_t;
extern volatile __PORTDbits_t PORTDbits __asm__ ("PORTD") __attribute__((section("sfrs"), address(0xBF802ED0)));
extern volatile uint32_t        PORTDCLR __attribute__((section("sfrs"),address(0xBF802ED4)));
extern volatile uint32_t        PORTDSET __attribute__((section("sfrs"),address(0xBF802ED8)));
extern volatile uint32_t        PORTDINV __attribute__((section("sfrs"),address(0xBF802EDC)));
#define LATD LATD
extern volatile uint32_t   LATD __attribute__((section("sfrs"), address(0xBF802EE0)));
typedef union {
  struct {
    uint32_t LATD0:1;
  };
  struct {
    uint32_t w:32;
  };
} __LATDbits_t;
