Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/include/proc/p32mm0128gpm048.h
#define _CNEN1A_CNIE1A15_POSITION                0x0000000F
#define _CNEN1A_CNIE1A15_MASK                    0x00008000
#define _CNEN1A_CNIE1A15_LENGTH                  0x00000001

#define _CNEN1A_w_POSITION                       0x00000000
#define _CNEN1A_w_MASK                           0xFFFFFFFF
#define _CNEN1A_w_LENGTH                         0x00000020

#define _CNFA_CNFA0_POSITION                     0x00000000
#define _CNFA_CNFA0_MASK                         0x00000001
#define _CNFA_CNFA0_LENGTH                       0x00000001

#define _CNFA_CNFA1_POSITION                     0x00000001
#define _CNFA_CNFA1_MASK                         0x00000002
#define _CNFA_CNFA1_LENGTH                       0x00000001

#define _CNFA_CNFA2_POSITION                     0x00000002
#define _CNFA_CNFA2_MASK                         0x00000004
#define _CNFA_CNFA2_LENGTH                       0x00000001

#define _CNFA_CNFA3_POSITION                     0x00000003
#define _CNFA_CNFA3_MASK                         0x00000008
#define _CNFA_CNFA3_LENGTH                       0x00000001

#define _CNFA_CNFA4_POSITION                     0x00000004
#define _CNFA_CNFA4_MASK                         0x00000010
#define _CNFA_CNFA4_LENGTH                       0x00000001

#define _CNFA_CNFA5_POSITION                     0x00000005
#define _CNFA_CNFA5_MASK                         0x00000020
#define _CNFA_CNFA5_LENGTH                       0x00000001

#define _CNFA_CNFA6_POSITION                     0x00000006
#define _CNFA_CNFA6_MASK                         0x00000040
#define _CNFA_CNFA6_LENGTH                       0x00000001

#define _CNFA_CNFA7_POSITION                     0x00000007
#define _CNFA_CNFA7_MASK                         0x00000080
#define _CNFA_CNFA7_LENGTH                       0x00000001

#define _CNFA_CNFA8_POSITION                     0x00000008
#define _CNFA_CNFA8_MASK                         0x00000100
#define _CNFA_CNFA8_LENGTH                       0x00000001

#define _CNFA_CNFA9_POSITION                     0x00000009
#define _CNFA_CNFA9_MASK                         0x00000200
#define _CNFA_CNFA9_LENGTH                       0x00000001

#define _CNFA_CNFA10_POSITION                    0x0000000A
#define _CNFA_CNFA10_MASK                        0x00000400
#define _CNFA_CNFA10_LENGTH                      0x00000001

#define _CNFA_CNFA15_POSITION                    0x0000000F
#define _CNFA_CNFA15_MASK                        0x00008000
#define _CNFA_CNFA15_LENGTH                      0x00000001

#define _CNFA_w_POSITION                         0x00000000
#define _CNFA_w_MASK                             0xFFFFFFFF
#define _CNFA_w_LENGTH                           0x00000020

#define _SR0A_w_POSITION                         0x00000000
#define _SR0A_w_MASK                             0xFFFFFFFF
#define _SR0A_w_LENGTH                           0x00000020

#define _SR1A_w_POSITION                         0x00000000
#define _SR1A_w_MASK                             0xFFFFFFFF
#define _SR1A_w_LENGTH                           0x00000020

#define _ANSELB_ANSB0_POSITION                   0x00000000
#define _ANSELB_ANSB0_MASK                       0x00000001
#define _ANSELB_ANSB0_LENGTH                     0x00000001

#define _ANSELB_ANSB1_POSITION                   0x00000001
#define _ANSELB_ANSB1_MASK                       0x00000002
#define _ANSELB_ANSB1_LENGTH                     0x00000001

#define _ANSELB_ANSB2_POSITION                   0x00000002
#define _ANSELB_ANSB2_MASK                       0x00000004
#define _ANSELB_ANSB2_LENGTH                     0x00000001

#define _ANSELB_ANSB3_POSITION                   0x00000003
#define _ANSELB_ANSB3_MASK                       0x00000008
#define _ANSELB_ANSB3_LENGTH                     0x00000001

#define _ANSELB_ANSB4_POSITION                   0x00000004
#define _ANSELB_ANSB4_MASK                       0x00000010
#define _ANSELB_ANSB4_LENGTH                     0x00000001

#define _ANSELB_ANSB13_POSITION                  0x0000000D
#define _ANSELB_ANSB13_MASK                      0x00002000
#define _ANSELB_ANSB13_LENGTH                    0x00000001

#define _ANSELB_ANSB14_POSITION                  0x0000000E
#define _ANSELB_ANSB14_MASK                      0x00004000
#define _ANSELB_ANSB14_LENGTH                    0x00000001

#define _ANSELB_ANSB15_POSITION                  0x0000000F
#define _ANSELB_ANSB15_MASK                      0x00008000
#define _ANSELB_ANSB15_LENGTH                    0x00000001

#define _ANSELB_w_POSITION                       0x00000000
#define _ANSELB_w_MASK                           0xFFFFFFFF
#define _ANSELB_w_LENGTH                         0x00000020

#define _B_ANSB0_POSITION                        0x00000000
#define _B_ANSB0_MASK                            0x00000001
#define _B_ANSB0_LENGTH                          0x00000001

#define _B_ANSB1_POSITION                        0x00000001
#define _B_ANSB1_MASK                            0x00000002
#define _B_ANSB1_LENGTH                          0x00000001

#define _B_ANSB2_POSITION                        0x00000002
#define _B_ANSB2_MASK                            0x00000004
#define _B_ANSB2_LENGTH                          0x00000001

#define _B_ANSB3_POSITION                        0x00000003
#define _B_ANSB3_MASK                            0x00000008
#define _B_ANSB3_LENGTH                          0x00000001

#define _B_ANSB4_POSITION                        0x00000004
#define _B_ANSB4_MASK                            0x00000010
#define _B_ANSB4_LENGTH                          0x00000001

#define _B_ANSB13_POSITION                       0x0000000D
#define _B_ANSB13_MASK                           0x00002000
#define _B_ANSB13_LENGTH                         0x00000001

#define _B_ANSB14_POSITION                       0x0000000E
#define _B_ANSB14_MASK                           0x00004000
#define _B_ANSB14_LENGTH                         0x00000001

#define _B_ANSB15_POSITION                       0x0000000F
#define _B_ANSB15_MASK                           0x00008000
#define _B_ANSB15_LENGTH                         0x00000001

#define _B_w_POSITION                            0x00000000
#define _B_w_MASK                                0xFFFFFFFF
#define _B_w_LENGTH                              0x00000020

