Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/include/proc/p32mm0128gpm048.h
/* Base Addresses for Peripherals */
#define _ADC_BASE_ADDRESS                        0xBF802100
#define _CCP1_BASE_ADDRESS                       0xBF800100
#define _CCP2_BASE_ADDRESS                       0xBF800200
#define _CCP3_BASE_ADDRESS                       0xBF800300
#define _CCP4_BASE_ADDRESS                       0xBF800400
#define _CCP5_BASE_ADDRESS                       0xBF800500
#define _CCP6_BASE_ADDRESS                       0xBF800600
#define _CCP7_BASE_ADDRESS                       0xBF800700
#define _CCP8_BASE_ADDRESS                       0xBF800800
#define _CCP9_BASE_ADDRESS                       0xBF800900
#define _CDAC1_BASE_ADDRESS                      0xBF802380
#define _CLC1_BASE_ADDRESS                       0xBF802480
#define _CLC2_BASE_ADDRESS                       0xBF802500
#define _CLC3_BASE_ADDRESS                       0xBF802580
#define _CLC4_BASE_ADDRESS                       0xBF802600
#define _CMP1_BASE_ADDRESS                       0xBF802310
#define _CMP2_BASE_ADDRESS                       0xBF802330
#define _CMP3_BASE_ADDRESS                       0xBF802350
#define _CRU_BASE_ADDRESS                        0xBF802680
#define _DMAC0_BASE_ADDRESS                      0xBF808960
#define _DMAC1_BASE_ADDRESS                      0xBF808A20
#define _DMAC2_BASE_ADDRESS                      0xBF808AE0
#define _DMAC3_BASE_ADDRESS                      0xBF808BA0
#define _DMAC_BASE_ADDRESS                       0xBF808900
#define _FRC_BASE_ADDRESS                        0xBF802880
#define _HLVD_BASE_ADDRESS                       0xBF802920
#define _I2C1_BASE_ADDRESS                       0xBF801500
#define _I2C2_BASE_ADDRESS                       0xBF801600
#define _I2C3_BASE_ADDRESS                       0xBF801700
#define _INT_BASE_ADDRESS                        0xBF80F000
#define _NVM_BASE_ADDRESS                        0xBF802930
#define _PORTA_BASE_ADDRESS                      0xBF802BB0
#define _PORTB_BASE_ADDRESS                      0xBF802CB0
#define _PORTC_BASE_ADDRESS                      0xBF802EB0
#define _RTCC_BASE_ADDRESS                       0xBF800000
#define _SPI1_BASE_ADDRESS                       0xBF808100
#define _SPI2_BASE_ADDRESS                       0xBF808200
#define _SPI3_BASE_ADDRESS                       0xBF808300
#define _TMR1_BASE_ADDRESS                       0xBF808000
#define _TMR2_BASE_ADDRESS                       0xBF808040
#define _TMR3_BASE_ADDRESS                       0xBF808080
#define _UART1_BASE_ADDRESS                      0xBF801800
#define _UART2_BASE_ADDRESS                      0xBF801900
#define _UART3_BASE_ADDRESS                      0xBF802000
#define _USB1_BASE_ADDRESS                       0xBF808440
#define _USB_BASE_ADDRESS                        0xBF808440
#define _WDT_BASE_ADDRESS                        0xBF803990

/* Default Memory-region macros */
#define __KSEG0_PROGRAM_MEM_BASE                 0x9D000000
#define __KSEG0_PROGRAM_MEM_LENGTH               0x20000
#define __DEBUG_EXEC_MEM_BASE                    0x9FC00490
#define __DEBUG_EXEC_MEM_LENGTH                  0x760
#define __KSEG1_BOOT_MEM_BASE                    0xBFC00000
#define __KSEG1_BOOT_MEM_LENGTH                  0x490
#define __KSEG0_DATA_MEM_BASE                    0x80000000
#define __KSEG0_DATA_MEM_LENGTH                  0x4000
#define __CONFIGSFRS_BFC01740_BASE               0xBFC01740
#define __CONFIGSFRS_BFC01740_LENGTH             0x1C
#define __CONFIGSFRS_BFC017C0_BASE               0xBFC017C0
#define __CONFIGSFRS_BFC017C0_LENGTH             0x1C
#define __SFRS_BASE                              0xBF800000
#define __SFRS_LENGTH                            0x100000

/*  The following device macros are predefined by the MPLAB XC32
 *  compiler when compiling with the -mprocessor=<device> option.
 *  We also define them here to help the MPLAB X editor evaluate
 *  them correctly.
 */
#ifndef __32MM0128GPM048
#  define __32MM0128GPM048 1
#endif
#ifndef __32MM0128GPM048__
#  define __32MM0128GPM048__ 1
#endif
#ifndef __XC__
#  define __XC__ 1
#endif
#ifndef __XC
#  define __XC 1
#endif
#ifndef __XC32__
#  define __XC32__ 1
#endif
#ifndef __XC32
#  define __XC32 1
#endif
#ifndef __PIC32MM
#  define __PIC32MM 1
#endif
#ifndef __PIC32MM__
#  define __PIC32MM__ 1
#endif
#ifndef __PIC32_FLASH_SIZE
#  define __PIC32_FLASH_SIZE 128
#endif
#ifndef __PIC32_FEATURE_SET
#  define __PIC32_FEATURE_SET "GP"
#endif
#ifndef __PIC32_FEATURE_SET__
#  define __PIC32_FEATURE_SET__ "GP"
#endif
#ifndef __PIC32_FEATURE_SET0
#  define __PIC32_FEATURE_SET0 'G'
#endif
#ifndef __PIC32_FEATURE_SET1
#  define __PIC32_FEATURE_SET1 'P'
#endif
#ifndef __PIC32_PRODUCT_GROUP
#  define __PIC32_PRODUCT_GROUP 'M'
#endif
#ifndef __PIC32_PIN_COUNT
#  define __PIC32_PIN_COUNT 48
#endif

/*  The following device macros indicate which core features are
 *  available on this device.
 */
#ifndef __PIC32_HAS_MICROMIPS
# define __PIC32_HAS_MICROMIPS 1
#endif
#ifndef __PIC32_HAS_MCUASE
# define __PIC32_HAS_MCUASE 1
#endif
#ifndef __PIC32_HAS_SSX
# define __PIC32_HAS_SSX 1
#endif
#ifndef __PIC32_HAS_INTCONVS
# define __PIC32_HAS_INTCONVS 1
#endif
#ifndef __PIC32_HAS_INIT_DATA
# define __PIC32_HAS_INIT_DATA 1
#endif
#ifndef __PIC32_SRS_SET_COUNT
# define __PIC32_SRS_SET_COUNT 2
#endif

#endif
